---
type: SpaceFilter
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# SpaceFilter

`Autodesk.Revit.DB.Mechanical.SpaceFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpaceFilter | — | `public SpaceFilter ()` |
| Method | PassesFilter | — | `` |